kiffie/pic32-pac/pic32mx2xxfxxxb/PIC32MX270F256B.svd
        <register>
          <name>ADC1BUFE</name>
          <description>ADC1BUFE register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFE</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFF</name>
          <description>ADC1BUFF register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CVR</name>
      <description>CVR peripheral</description>
      <baseAddress>0xbf809800</baseAddress>
      <registers>
        <register>
          <name>CVRCON</name>
          <description>CVRCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONCLR</name>
          <description>CVRCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONSET</name>
          <description>CVRCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONINV</name>
          <description>CVRCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP1</name>
      <description>CMP1 peripheral</description>
      <baseAddress>0xbf80a000</baseAddress>
      <registers>
        <register>
          <name>CM1CON</name>
          <description>CM1CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>195</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1CONCLR</name>
          <description>CM1CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1CONSET</name>
          <description>CM1CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1CONINV</name>
          <description>CM1CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
