kiffie/pic32-pac/pic32mx2xxfxxxb/PIC32MX270F256B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>USB peripheral</description>
      <baseAddress>0xbf885040</baseAddress>
      <registers>
        <register>
          <name>U1OTGIR</name>
          <description>U1OTGIR register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSVDIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SESENDIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SESVDIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTVIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSTATEIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>T1MSECIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGIRCLR</name>
          <description>U1OTGIRCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSVDIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SESENDIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SESVDIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTVIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSTATEIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>T1MSECIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGIE</name>
          <description>U1OTGIE register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSVDIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SESENDIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SESVDIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTVIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSTATEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>T1MSECIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IDIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGIECLR</name>
          <description>U1OTGIECLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSVDIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SESENDIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SESVDIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTVIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSTATEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>T1MSECIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IDIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGIESET</name>
          <description>U1OTGIESET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSVDIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SESENDIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SESVDIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTVIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSTATEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>T1MSECIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IDIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGIEINV</name>
          <description>U1OTGIEINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSVDIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SESENDIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SESVDIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTVIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSTATEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>T1MSECIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IDIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGSTAT</name>
          <description>U1OTGSTAT register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSVD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SESEND</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SESVD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LSTATE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ID</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGCON</name>
          <description>U1OTGCON register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSDIS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VBUSCHG</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OTGEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>VBUSON</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMPULDWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DPPULDWN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMPULUP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DPPULUP</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGCONCLR</name>
          <description>U1OTGCONCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSDIS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VBUSCHG</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OTGEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>VBUSON</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMPULDWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DPPULDWN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMPULUP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DPPULUP</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGCONSET</name>
          <description>U1OTGCONSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSDIS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VBUSCHG</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OTGEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>VBUSON</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMPULDWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DPPULDWN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMPULUP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DPPULUP</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1OTGCONINV</name>
          <description>U1OTGCONINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VBUSDIS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VBUSCHG</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OTGEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>VBUSON</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMPULDWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DPPULDWN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMPULUP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DPPULUP</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1PWRC</name>
          <description>U1PWRC register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBPWR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USUSPEND</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBBUSY</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USLPGRD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UACTPND</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1PWRCCLR</name>
          <description>U1PWRCCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBPWR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USUSPEND</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBBUSY</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USLPGRD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UACTPND</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1PWRCSET</name>
          <description>U1PWRCSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBPWR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USUSPEND</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBBUSY</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USLPGRD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UACTPND</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1PWRCINV</name>
          <description>U1PWRCINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBPWR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USUSPEND</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBBUSY</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USLPGRD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UACTPND</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1IR</name>
          <description>U1IR register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URSTIF_DETACHIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UERRIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SOFIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESUMEIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ATTACHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STALLIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1IRCLR</name>
          <description>U1IRCLR register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URSTIF_DETACHIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UERRIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SOFIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESUMEIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ATTACHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STALLIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1IE</name>
          <description>U1IE register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URSTIE_DETACHIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UERRIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SOFIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESUMEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ATTACHIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STALLIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1IECLR</name>
          <description>U1IECLR register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URSTIE_DETACHIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UERRIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SOFIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESUMEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ATTACHIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STALLIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1IESET</name>
          <description>U1IESET register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URSTIE_DETACHIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UERRIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SOFIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESUMEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ATTACHIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STALLIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1IEINV</name>
          <description>U1IEINV register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URSTIE_DETACHIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UERRIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SOFIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESUMEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ATTACHIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STALLIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
