kiffie/pic32-pac/pic32mx2xxfxxxb/PIC32MX270F256B.svd
        <register>
          <name>U1EIR</name>
          <description>U1EIR register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PIDEF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRC5EF_EOFEF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRC16EF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DFN8EF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BTOEF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BMXEF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BTSEF</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EIRCLR</name>
          <description>U1EIRCLR register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PIDEF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRC5EF_EOFEF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRC16EF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DFN8EF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BTOEF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BMXEF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BTSEF</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EIE</name>
          <description>U1EIE register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PIDEE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRC5EE_EOFEE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRC16EE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DFN8EE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BTOEE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BMXEE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BTSEE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EIECLR</name>
          <description>U1EIECLR register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PIDEE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRC5EE_EOFEE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRC16EE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DFN8EE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BTOEE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BMXEE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BTSEE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EIESET</name>
          <description>U1EIESET register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PIDEE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRC5EE_EOFEE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRC16EE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DFN8EE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BTOEE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BMXEE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BTSEE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EIEINV</name>
          <description>U1EIEINV register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PIDEE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRC5EE_EOFEE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRC16EE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DFN8EE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BTOEE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAEE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BMXEE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BTSEE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1STAT</name>
          <description>U1STAT register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PPBI</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ENDPT</name>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CON</name>
          <description>U1CON register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBEN_SOFEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PPBRST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESUME</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HOSTEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PKTDIS_TOKBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SE0</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>JSTATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CONCLR</name>
          <description>U1CONCLR register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBEN_SOFEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PPBRST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESUME</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HOSTEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PKTDIS_TOKBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SE0</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>JSTATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CONSET</name>
          <description>U1CONSET register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBEN_SOFEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PPBRST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESUME</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HOSTEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PKTDIS_TOKBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SE0</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>JSTATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1CONINV</name>
          <description>U1CONINV register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBEN_SOFEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PPBRST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESUME</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HOSTEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBRST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PKTDIS_TOKBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SE0</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>JSTATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1ADDR</name>
          <description>U1ADDR register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DEVADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>LSPDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1ADDRCLR</name>
          <description>U1ADDRCLR register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DEVADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>LSPDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1ADDRSET</name>
          <description>U1ADDRSET register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DEVADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>LSPDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1ADDRINV</name>
          <description>U1ADDRINV register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DEVADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>LSPDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP1</name>
          <description>U1BDTP1 register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRL</name>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP1CLR</name>
          <description>U1BDTP1CLR register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRL</name>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP1SET</name>
          <description>U1BDTP1SET register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRL</name>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP1INV</name>
          <description>U1BDTP1INV register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRL</name>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1FRML</name>
          <description>U1FRML register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRML</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1FRMH</name>
          <description>U1FRMH register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMH</name>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TOK</name>
          <description>U1TOK register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PID</name>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TOKCLR</name>
          <description>U1TOKCLR register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PID</name>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TOKSET</name>
          <description>U1TOKSET register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PID</name>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TOKINV</name>
          <description>U1TOKINV register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PID</name>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1SOF</name>
          <description>U1SOF register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1SOFCLR</name>
          <description>U1SOFCLR register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1SOFSET</name>
          <description>U1SOFSET register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1SOFINV</name>
          <description>U1SOFINV register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2</name>
          <description>U1BDTP2 register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2CLR</name>
          <description>U1BDTP2CLR register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2SET</name>
          <description>U1BDTP2SET register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP2INV</name>
          <description>U1BDTP2INV register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRH</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3</name>
          <description>U1BDTP3 register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3CLR</name>
          <description>U1BDTP3CLR register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3SET</name>
          <description>U1BDTP3SET register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BDTP3INV</name>
          <description>U1BDTP3INV register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDTPTRU</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
